-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: qt_data
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `student`
--
create database qt_data;
use qt_data;

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` text,
  `age` int DEFAULT NULL,
  `grade` int DEFAULT NULL,
  `class` int DEFAULT NULL,
  `studentid` int DEFAULT NULL,
  `phone` text,
  `wechat` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=96 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES (1,'巫马淑慧',72,9,6,0,'138','139'),(2,'可书',16,7,1,1,'138','139'),(3,'乾刚洁',16,8,5,2,'138','139'),(4,'劳嘉德',17,7,7,3,'138','139'),(5,'图门采绿',16,7,6,4,'138','139'),(6,'理雪兰',16,8,3,5,'138','139'),(7,'芒柔怀',17,7,2,6,'138','139'),(8,'褚冬灵',16,7,5,7,'138','139'),(9,'沙逸馨',16,9,3,8,'138','139'),(10,'甫凡儿',17,9,5,9,'138','139'),(11,'良聪睿',16,9,4,10,'138','139'),(12,'权景铄',16,9,7,11,'138','139'),(13,'萨翔飞',17,7,5,12,'138','139'),(14,'符文耀',16,7,5,13,'138','139'),(15,'韩平灵',16,9,1,14,'138','139'),(16,'微生芷琪',17,8,3,15,'138','139'),(17,'吕和煦',16,9,2,16,'138','139'),(18,'却梦露',16,7,1,17,'138','139'),(19,'连嘉惠',17,7,2,18,'138','139'),(20,'在巧兰',16,8,1,19,'138','139'),(21,'程易云',16,9,7,20,'138','139'),(22,'塞北晶',18,9,5,21,'138','139'),(23,'终笑天',16,9,5,22,'138','139'),(24,'朱高岑',16,9,1,23,'138','139'),(25,'储文滨',17,7,7,24,'138','139'),(26,'检紫薇',16,7,5,25,'138','139'),(27,'端木春华',16,9,2,26,'138','139'),(28,'惠婵娟',17,7,1,27,'138','139'),(29,'疏清雅',16,7,5,28,'138','139'),(30,'骑轶',16,7,3,29,'138','139'),(31,'范抒',17,9,4,30,'138','139'),(32,'夙映',16,7,5,31,'138','139'),(33,'吉华容',16,8,4,32,'138','139'),(34,'庚璟',17,7,4,33,'138','139'),(35,'贲又蓝',16,7,3,34,'138','139'),(36,'谬娜兰',16,9,5,35,'138','139'),(37,'彭高阳',17,9,7,36,'138','139'),(38,'宏甜恬',16,8,7,37,'138','139'),(39,'卞慕梅',16,7,7,38,'138','139'),(40,'杞磊',17,9,7,39,'138','139'),(41,'安静',16,8,3,40,'138','139'),(42,'善忆之',16,9,4,41,'138','139'),(43,'禚悦可',16,8,4,42,'138','139'),(44,'刚子萱',16,9,5,43,'138','139'),(45,'利源',16,9,4,44,'138','139'),(46,'扬秋蝶',17,7,7,45,'138','139'),(47,'董雨信',16,7,7,46,'138','139'),(48,'邝冷雪',16,7,3,47,'138','139'),(49,'庄景龙',17,9,6,48,'138','139'),(50,'才凝芙',16,8,5,49,'138','139'),(51,'瓮菁菁',16,8,2,50,'138','139'),(52,'迟晓莉',17,9,5,51,'138','139'),(53,'毛兴文',16,7,2,52,'138','139'),(54,'游雨筠',16,7,2,53,'138','139'),(55,'艾妙松',17,9,6,54,'138','139'),(56,'张廖昶',16,7,3,55,'138','139'),(57,'铁元旋',16,8,2,56,'138','139'),(58,'干瑜蓓',17,9,7,57,'138','139'),(59,'伊鸿文',16,9,3,58,'138','139'),(60,'喻水凡',16,7,5,59,'138','139'),(61,'慎和豫',17,9,4,60,'138','139'),(62,'回雅可',16,9,3,61,'138','139'),(63,'接雅晗',16,8,7,62,'138','139'),(64,'巫问筠',18,8,6,63,'138','139'),(65,'乙亦绿',16,9,7,64,'138','139'),(66,'尉迟梧',16,8,7,65,'138','139'),(67,'丑真一',17,8,5,66,'138','139'),(68,'莫波光',16,9,3,67,'138','139'),(69,'裔幼荷',16,9,4,68,'138','139'),(70,'佘斯',17,7,4,69,'138','139'),(71,'熊梓柔',16,8,5,70,'138','139'),(74,'建妙颜',16,9,4,73,'138','139'),(77,'舜初蝶',16,7,2,76,'138','139'),(78,'莘令梓',16,9,5,77,'138','139'),(79,'时笑卉',17,7,2,78,'138','139'),(80,'舒梦之',16,8,4,79,'138','139'),(81,'卑芸若',16,9,4,80,'138','139'),(82,'伏俊爽',17,9,6,81,'138','139'),(83,'江春',16,8,1,82,'138','139'),(84,'羽高邈',16,7,1,83,'138','139'),(85,'凌夏山',16,9,6,84,'138','139'),(86,'邬新雨',16,8,1,85,'138','139'),(87,'束梦竹',16,7,5,86,'138','139'),(88,'毋雅柏',17,8,4,87,'138','139'),(89,'康乐天',16,7,2,88,'138','139'),(90,'荤忆曼',16,9,3,89,'138','139'),(91,'蛮凡双',17,8,7,90,'138','139'),(92,'冒和顺',16,8,3,91,'138','139'),(93,'道春晓',16,8,2,92,'138','139'),(94,'隋乐蓉',17,7,2,93,'138','139'),(95,'松海逸',16,9,1,94,'138','139');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `username`
--

DROP TABLE IF EXISTS `username`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `username` (
  `username` text,
  `password` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `username`
--

LOCK TABLES `username` WRITE;
/*!40000 ALTER TABLE `username` DISABLE KEYS */;
INSERT INTO `username` VALUES ('zyh','123456');
/*!40000 ALTER TABLE `username` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-07-21 20:42:49
